# 1. შექმენით სია, სადაც გექნებათ 5 ელემენტი,
# შემდეგ, დადებითი ინდექსინგის გამოყენებით გამოიტანეთ მე-3 და მე-4.

my_list = [10, 20, 30, 40, 50]
print("მე-3 ელემენტი:", my_list[2])  
print("მე-4 ელემენტი:", my_list[3])  

# 2. შექმენით სია, სადაც გექნებათ 5 ელემენტი,
# შემდეგ, უარყოფითი ინდექსინგის გამოყენებით გამოიტანეთ მესამე ელემენტი.

my_list = [100, 200, 300, 400, 500]
print( my_list[-3])  

# 3. შექმენით სია, სადაც გექნებათ 5 რიცხვი,
# შემდეგ დაპრინტე მათი მინიმალური რიცხვი და მაქსიმალური რიცხვი.

numbers = [3, 5, 7, 2, 9]
print("მინიმალური :", min(numbers))
print("მაქსიმალური :", max(numbers))

