# 1. ცვლადში შეინახე სტრინგი დიდი ასოებით, 
# შემდეგ .lower() ფუნქციის მეშვეობით გადააქციე ცვლადი პატარა ასოებად. 

name = 'GOA'
print(name.lower())

# 2. ცვლადში შეინახე სტრინგი პატარა ასოებით,
# შემდეგ .upper() ფუნქციის მეშვეობით გადააქციე ცვლადი დიდ ასოებად.

name = 'goa'
print(name.upper())

# 3. ცვლადში შეინახე სტრინგი პატარა ასოებით,
# შემდეგ .capitalize() ფუნქციის მეშვეობით გადააქციე პირველი ასო დიდ ასოდ.


name = 'goa'
print(name.capitalize())

# მომხარებელს შემოატანინე სიტყვა, შემდეგ გადააქციე პატარა ასოებად და დაპრინტე.

name = input("შეიყვანე სიტყვა დიდი ასოებით")
print(name.lower())