
# Sequencing, Iteration, Selection

# Sequencing (გაგრძელება)
# ეს არის ალგორითმის ელემენტების განსაზღვრა, თუ რა რიგით უნდა შესრულდეს.
#  ანუ, ერთი ბრძანების შემდეგ, გადადის მომდევნო ბრძანებაზე, თანმიმდევრულად.

# Iteration (ციკლები)
# ეს არის ალგორითმის იმ ელემენტების განსაზღვრა, რომლებიც განმეორებით უნდა შესრულდეს.
#  ციკლები საშუალებას გვაძლევს განმეორებით გავაკეთოთ ერთი და იგივე მოქმედებები, მანამ სანამ გარკვეული პირობა შესრულდება.
# ძირითადი ციკლები არიან: for და while ციკლები.

# Selection (არჩევანი)
# ეს არის ალგორითმის იმ ელემენტების განსაზღვრა, რომლებიც საშუალებას გვაძლევს შევარჩიოთ სხვადასხვა გზები.
#  არჩევანი ხდება პირობების მიხედვით და ამისთვის ძირითადად ვიყენებთ if, else if და else კონსტრუქციებს.
