# 1. შექმენით სია, სადაც გექნებათ თქვენი მეგობრების სახელები, შემდეგ დაპრინტეთ პირველი ორი მეგობრის სახელი.


#  სია მეგობრების სახელებით
friends = ["ილია", "გიორგი", "საბა", "ლუკა", "ირაკლი"]

#  პირველ და მეოთხე მეგობრის სახელს
print(friends[0])  # ილია
print(friends[1])  # გიორგი

# 2. შექმენით სია, სადაც გექნებათ 5 რიცხვი, შემდეგ კი დარპინტეთ პირველი და მეოთხე ელემენტების ჯამი.

# ვქმნით სია 5 რიცხვით
numbers = [10, 20, 30, 40, 50]

# პირველი და მეოთხე ელემენტების ჯამი
sum_result = numbers[0] + numbers[2]
print(sum_result)  # 50
