
# int (მთელი რიცხვი) 
# ეს არის მონაცემების ტიპი, რომელიც გამოიყენება მთელი რიცხვების გამოსახატად. მაგალითად: -2, 0, 5, 42.
a = 5  # 'a' არის int ტიპის და ინახავს მთელ რიცხვს 5

# float (მცურავი წერტილი)
#ეს არის მონაცემების ტიპი, რომელიც გამოიყენება ნამდვილი რიცხვების გამოსახატად,
#რომლებსაც შეუძლიათ ჰქონდეთ ათწილადი წერტილი. მაგალითად: 3.14, -0.001, 2.0.
b = 3.14  # 'b' არის float ტიპის და ინახავს ნამდვილი რიცხვი 3.14

# str (სტრიქონი)
#ეს არის მონაცემების ტიპი, რომელიც გამოიყენება ტექსტის ან სიმბოლოების რიგის გამოსახატად.
#სტრიქონები იწერება ბრჭყალებში (" ") ან აპოსტროფებში (' '). მაგალითად: "გამარჯობა", '123', "Python".
c = "გამარჯობა"  # 'c' არის str ტიპის და ინახავს სტრიქონს "გამარჯობა"
