# მომხმარებელს მოთხოვნილია შეიყვანოს ორი რიცხვი
num1 = int(input("Enter the first number: "))  # პირველი რიცხვი გადაყვანილია int ტიპში
num2 = int(input("Enter the second number: ")) # მეორე რიცხვი გადაყვანილია int ტიპში

# ვასრულებთ არითმეტიკულ ოპერაციებს
a = num1 + num2         # შეკრება
b = num1 - num2      # გამოკლება
c = num1 * num2   # გამრავლება
d = num1 / num2         # გაყოფა

# ვბეჭდავთ შედეგებს
print(a)  # დაბეჭდავს შეკრების შედეგს
print(b) # დაბეჭდავს გამოკლების შედეგს
print(c) # დაბეჭდავს გამრავლების შედეგს
print(d) # დაბეჭდავს გაყოფის შედეგს