# Input და Output მაგალითი Python-ში

# Input-ის კარგი მაგალითი input()-ია და Output-ის მაგალითი print()-ი

# input() ფუნქცია გამოიყენება მომხმარებლისგან მონაცემების მისაღებად.
# მომხმარებელს აქვს მოთხოვნილი შეიყვანოს მონაცემები.
name = input("Enter your name: ")

# print() ფუნქცია გამოიყენება მონაცემების ეკრანზე გამოსატანად.
# მას გამოაქვს ტექსტი და სხვა მონაცემები, რომლებიც საჭიროა მომხმარებლისთვის.
print("Hello" + name)  # აქ გამოდის ტექსტი "Hello" და მომხმარებლის მიერ შეყვანილი სახელი

# input() ფუნქცია მეორედ გამოიყენება, რათა მომხმარებელმა რიცხვი შეიყვანოს.
number = input("Enter a number: ")

# print() ფუნქცია მეორედ გამოიყენება, რათა გამოიტანოს მომხმარებლის მიერ შეყვანილი რიცხვი.
print("You entered " + number)  # აქ გამოდის ტექსტი "You entered" და მომხმარებლის მიერ შეყვანილი რიცხვი

# კომენტარების გამოყენება არის ერთერთი ყველაზე საუკეთესო პრაქტიკა.
# კომენტარები გამოიყენება კოდის გასაგებად და მის ახსნად.
# ისინი იწყება '#' სიმბოლოთი და არ ექვემდებარებიან შესრულებას.
# კომენტარები აუცილებელია რთული კოდის ნაწილების გასახსნელად.

# მარტივი კომენტარი: გამოიყენება კოდის პატარა ნაწილის გასაგებად
x = 5  # ცვლადი x ინახავს რიცხვს 5